app/views/users/index.html.erb

SELECT "users".* FROM "users"
---

        <% if !current_user.friended_users.include?(user) && user != current_user %>