app/controllers/password_resets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "nomail@nomail.com"]]
---
  def create
    if @user = User.find_by(email: params[:password_reset][:email])

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "virtucio_test@test.com"]]
---
  def edit
    @user = User.find_by(email: params[:email])