app/controllers/users_controller.rb

  def destroy
    current_user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]