app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.from_omniauth(env["omniauth.auth"]) || User.new(user_params)
    if @user.save && @user.build_profile.save

SELECT "users".* FROM "users"
---
  def index
    @users = User.search(params[:query])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def set_user_and_profile
    @user =  User.includes(:profile).find(params[:id])